### WE have tried to clean the row data on small sample

In [1]:
import pandas as pd

In [41]:
df = pd.read_excel("Rawdata.xlsx")

In [43]:
print(df)

     Name          Domain       Age   Location   Salary      Exp
0    Mike   Datascience#$  34 years     Mumbai   5^00#0       2+
1  Teddy^         Testing    45' yr  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst^^#       NaN        NaN  1$5%000   4> yrs
3    Jane     Ana^^lytics       NaN   Hyderbad   2000^0      NaN
4  Uttam*      Statistics     67-yr        NaN   30000-  5+ year
5     Kim             NLP      55yr      Delhi  6000^$0      10+

In [45]:
df.shape

(6, 6)

In [47]:
df.columns

Index(['Name', 'Domain', 'Age', 'Location', 'Salary', 'Exp'], dtype='object')

In [49]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      object
 1   Domain    6 non-null      object
 2   Age       4 non-null      object
 3   Location  4 non-null      object
 4   Salary    6 non-null      object
 5   Exp       5 non-null      object
dtypes: object(6)
memory usage: 420.0+ bytes

In [55]:
df.columns = df.columns.str.lower()

In [57]:
print(df)

     name          domain       age   location   salary      exp
0    Mike   Datascience#$  34 years     Mumbai   5^00#0       2+
1  Teddy^         Testing    45' yr  Bangalore  10%%000       <3
2   Uma#r  Dataanalyst^^#       NaN        NaN  1$5%000   4> yrs
3    Jane     Ana^^lytics       NaN   Hyderbad   2000^0      NaN
4  Uttam*      Statistics     67-yr        NaN   30000-  5+ year
5     Kim             NLP      55yr      Delhi  6000^$0      10+

In [59]:
df['name']

0      Mike
1    Teddy^
2     Uma#r
3      Jane
4    Uttam*
5       Kim
Name: name, dtype: object

In [69]:
df['name'] = df['name'].str.replace(r'\W','',regex = True)

In [71]:
df['name']

0     Mike
1    Teddy
2     Umar
3     Jane
4    Uttam
5      Kim
Name: name, dtype: object

In [75]:
df['domain']

0     Datascience#$
1           Testing
2    Dataanalyst^^#
3       Ana^^lytics
4        Statistics
5               NLP
Name: domain, dtype: object

In [77]:
df['domain'] = df['domain'].str.replace(r'\W','',regex = True)

In [79]:
df['domain']

0    Datascience
1        Testing
2    Dataanalyst
3      Analytics
4     Statistics
5            NLP
Name: domain, dtype: object

In [81]:
print(df)

    name       domain       age   location   salary      exp
0   Mike  Datascience  34 years     Mumbai   5^00#0       2+
1  Teddy      Testing    45' yr  Bangalore  10%%000       <3
2   Umar  Dataanalyst       NaN        NaN  1$5%000   4> yrs
3   Jane    Analytics       NaN   Hyderbad   2000^0      NaN
4  Uttam   Statistics     67-yr        NaN   30000-  5+ year
5    Kim          NLP      55yr      Delhi  6000^$0      10+

In [83]:
df['age']

0    34 years
1      45' yr
2         NaN
3         NaN
4       67-yr
5        55yr
Name: age, dtype: object

In [87]:
df['age'] = df['age'].str.extract(r'(\d+)')

In [89]:
df['age']

0     34
1     45
2    NaN
3    NaN
4     67
5     55
Name: age, dtype: object

In [91]:
df['location']

0       Mumbai
1    Bangalore
2          NaN
3     Hyderbad
4          NaN
5        Delhi
Name: location, dtype: object

In [93]:
df['location'] = df['location'].str.replace(r'\W','')

In [95]:
df['location']

0       Mumbai
1    Bangalore
2          NaN
3     Hyderbad
4          NaN
5        Delhi
Name: location, dtype: object

In [97]:
df['salary']

0     5^00#0
1    10%%000
2    1$5%000
3     2000^0
4     30000-
5    6000^$0
Name: salary, dtype: object

In [105]:
df['salary'] = df['salary'].str.replace(r'\W','',regex = True)

In [107]:
df['salary']

0     5000
1    10000
2    15000
3    20000
4    30000
5    60000
Name: salary, dtype: object

In [109]:
df['exp']

0         2+
1         <3
2     4> yrs
3        NaN
4    5+ year
5        10+
Name: exp, dtype: object

In [111]:
df['exp'] = df['exp'].str.extract('(\d+)')

In [113]:
df['exp']

0      2
1      3
2      4
3    NaN
4      5
5     10
Name: exp, dtype: object

In [115]:
print(df)

    name       domain  age   location salary  exp
0   Mike  Datascience   34     Mumbai   5000    2
1  Teddy      Testing   45  Bangalore  10000    3
2   Umar  Dataanalyst  NaN        NaN  15000    4
3   Jane    Analytics  NaN   Hyderbad  20000  NaN
4  Uttam   Statistics   67        NaN  30000    5
5    Kim          NLP   55      Delhi  60000   10